In [2]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['1','2','3','4','5'],columns=['1','2','3','4'])

In [3]:
df.head()

    1   2   3   4
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19

In [4]:
#access elements using --> loc , iloc
#loc focuses only on row indices and iloc focuses on both row and column
df.loc['1']

1    0
2    1
3    2
4    3
Name: 1, dtype: int32

In [5]:
type(df.loc['1'])

pandas.core.series.Series

In [6]:
df.iloc[0:2,0:3]

   1  2  3
1  0  1  2
2  4  5  6

In [7]:
type(df.iloc[0:2,0:3])

pandas.core.frame.DataFrame

In [8]:
df.iloc[0:2,0:3].values

array([[0, 1, 2],
       [4, 5, 6]])

In [19]:
df['1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: 1, dtype: int64

In [13]:
df.isnull().sum()

1    0
2    0
3    0
4    0
dtype: int64

In [21]:
df=pd.read_csv('mercedes_benz_train.csv')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [24]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [25]:
df['X10'].value_counts()

0    4153
1      56
Name: X10, dtype: int64

In [26]:
from io import StringIO
data=('a,d,c,v\n'
       's,r,w,w\n')

In [27]:
print(data)

a,d,c,v
s,r,w,w

In [28]:
df=pd.read_csv(StringIO(data),dtype=object)

In [29]:
df

   a  d  c  v
0  s  r  w  w

In [32]:
df1=pd.read_csv(StringIO(data),dtype=str)
df1

   a  d  c  v
0  s  r  w  w

In [33]:
data1=('1,2,3,4\n'
       '331,45,12,12\n')

In [34]:
df2=pd.read_csv(StringIO(data1),dtype={'1':int,'2':np.float,'3':'Int64'})

In [35]:
df2

     1     2   3   4
0  331  45.0  12  12

In [36]:
df2.dtypes

1      int32
2    float64
3      Int64
4      int64
dtype: object

In [48]:
data3=('a,d,c,s\n'
       '1,apple,cow\n'
        '2,ape,www\n')

In [49]:
data3

'a,d,c,s\n1,apple,cow\n2,ape,www\n'

In [53]:
df1=pd.read_csv(StringIO(data3))
df2=pd.read_csv(StringIO(data3),usecols=['d','c'])

In [51]:
df1

   a      d    c   s
0  1  apple  cow NaN
1  2    ape  www NaN

In [54]:
df2

       d    c
0  apple  cow
1    ape  www

In [55]:
df4=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data',header=None)

In [56]:
df4.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735